In [1]:
import pandas as pd
import numpy as np

# Use of Merge (DataFrame Joining)

In [111]:
dict1 = {'places':['paris','london','mumbai','newyork','stockholm'],
        'population':list(np.floor(np.random.random(5)*1000000))}
dict2 = {'places':['mumbai','paris','newyork','london','stockholm'],
        'area':list(np.floor(np.random.random(5)*1000000))}

In [41]:
dict3 = {'places':['paris','london','mumbai','newyork','stockholm'],
        'population':list(np.floor(np.random.random(5)*1000000)),
        'avg_salary':list(np.floor(np.random.random(5)*10000))}
dict4 = {'places':['paris','london','mumbai','newyork','stockholm'],
        'area':list(np.floor(np.random.random(5)*1000000)),
        'avg_salary':list(np.floor(np.random.random(5)*10000))}

In [42]:
dict1

{'places': ['paris', 'london', 'mumbai', 'newyork', 'stockholm'],
 'population': [569031.0, 387368.0, 958811.0, 129231.0, 962215.0]}

In [43]:
dict2

{'area': [863570.0, 202837.0, 269796.0, 131411.0, 57982.0],
 'places': ['paris', 'london', 'mumbai', 'newyork', 'stockholm']}

In [44]:
dict3

{'avg_salary': [9769.0, 2829.0, 7555.0, 5452.0, 2971.0],
 'places': ['paris', 'london', 'mumbai', 'newyork', 'stockholm'],
 'population': [249813.0, 622321.0, 46799.0, 551813.0, 209587.0]}

In [45]:
dict4

{'area': [503622.0, 699201.0, 685136.0, 328588.0, 115603.0],
 'avg_salary': [9353.0, 411.0, 582.0, 7622.0, 7719.0],
 'places': ['paris', 'london', 'mumbai', 'newyork', 'stockholm']}

In [112]:
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)

In [86]:
df1

      places  population
0      paris    621420.0
1     london    604026.0
2     mumbai    656422.0
3    newyork    392994.0
4  stockholm    240029.0

In [87]:
df2

      places      area
0     mumbai  770865.0
1      paris  551533.0
2    newyork  884008.0
3     london  109263.0
4  stockholm  517052.0

In [84]:
df = pd.merge(df1,df2,how='inner',on=['places'])

In [85]:
df

      places  population      area
0      paris    621420.0  551533.0
1     london    604026.0  109263.0
2     mumbai    656422.0  770865.0
3    newyork    392994.0  884008.0
4  stockholm    240029.0  517052.0

In [51]:
df3 = pd.DataFrame(dict3)
df4 = pd.DataFrame(dict4)

In [52]:
df3

      places  population  avg_salary
0      paris    249813.0      9769.0
1     london    622321.0      2829.0
2     mumbai     46799.0      7555.0
3    newyork    551813.0      5452.0
4  stockholm    209587.0      2971.0

In [53]:
df4

      places      area  avg_salary
0      paris  503622.0      9353.0
1     london  699201.0       411.0
2     mumbai  685136.0       582.0
3    newyork  328588.0      7622.0
4  stockholm  115603.0      7719.0

In [60]:
df_1 = pd.merge(df3,df4,how='inner',on=['places'])
#df_1 = pd.merge(df3,df4[['places','area']],how='inner',on=['places'])

In [61]:
df_1

      places  population  avg_salary_x      area  avg_salary_y
0      paris    249813.0        9769.0  503622.0        9353.0
1     london    622321.0        2829.0  699201.0         411.0
2     mumbai     46799.0        7555.0  685136.0         582.0
3    newyork    551813.0        5452.0  328588.0        7622.0
4  stockholm    209587.0        2971.0  115603.0        7719.0

# Use of Append

In [73]:
df1.append(df2,ignore_index=False)

C:\Users\somak.sengupta\Anaconda3\lib\site-packages\pandas\core\frame.py:6701: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

       area     places  population
0       NaN      paris    621420.0
1       NaN     london    604026.0
2       NaN     mumbai    656422.0
3       NaN    newyork    392994.0
4       NaN  stockholm    240029.0
0  770865.0     mumbai         NaN
1  551533.0      paris         NaN
2  884008.0    newyork         NaN
3  109263.0     london         NaN
4  517052.0  stockholm         NaN

# Use of Concat

In [83]:
#pd.concat([df1,df2],axis=0)
pd.concat([df1,df2],axis=1)

      places  population     places      area
0      paris    621420.0     mumbai  770865.0
1     london    604026.0      paris  551533.0
2     mumbai    656422.0    newyork  884008.0
3    newyork    392994.0     london  109263.0
4  stockholm    240029.0  stockholm  517052.0

# Join on index

In [107]:
df1.set_index('places',inplace=True)
df2.set_index('places',inplace=True)

In [119]:
df1

           population
places
paris        537051.0
london       956299.0
mumbai       463975.0
newyork      373823.0
stockholm     61358.0

In [120]:
df2

               area
places
mumbai      75011.0
paris      776788.0
newyork    693583.0
london     418097.0
stockholm   53918.0

In [118]:
df1.join(df2,how='inner',on='places')

           population      area
places
paris        537051.0  776788.0
london       956299.0  418097.0
mumbai       463975.0   75011.0
newyork      373823.0  693583.0
stockholm     61358.0   53918.0